
## Plan Result (prod)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fee_pay_team_refund_subscription
  * azurerm_api_management_subscription.liberata_supplier_refund_subscription
  * azurerm_key_vault_secret.fee_pay_team_refund_subscription_key
  * azurerm_key_vault_secret.liberata_supplier_refund_subscription_key
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product
  * module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_refund_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_refund_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Refund Status API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.liberata_supplier_refund_subscription will be created
  + resource "azurerm_api_management_subscription" "liberata_supplier_refund_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Refund Status API - Liberata Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_refund_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_refund_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "fee-pay-team-refund-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.liberata_supplier_refund_subscription_key will be created
  + resource "azurerm_key_vault_secret" "liberata_supplier_refund_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "liberata-cft-apim-refund-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Refund Status API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "refunds-api"
      + path                  = "refunds-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "1"
      + service_url           = "http://ccpay-refunds-api-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/ccpay-payment-app.refunds-status-v1.json"
        }
    }

  # module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "refunds-api"
      + id                  = (known after apply)
      + product_id          = "refunds"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "refunds-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Headers["X-ARR-ClientCertThumbprint"] == null)">
                    <return-response>
                      <set-status code="401" />
                      <set-body>Missing client certificate.</set-body>
                    </return-response>
                  </when>
                  <when condition="@(!(new string[] {&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;}.Contains(context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;].First().ToUpperInvariant())))">
                    <return-response>
                      <set-status code="401" />
                      <set-body>Invalid client certificate.</set-body>
                    </return-response>
                  </when>
                  <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="401" />
                      <set-body>Invalid client certificate. Please check expiry.</set-body>
                    </return-response>
                  </when>
                </choose>
                <!-- generate totp -->
                <set-variable name="client_id" value="api_gw" />
                <set-variable name="client_secret" value="JBSAAHPPEHPK3PXP" />
                <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "JBSAAHPPEHPK3PXP".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                var timeIndex = unixTimestamp / 30;
                byte[] challenge = BitConverter.GetBytes(timeIndex);
                if (BitConverter.IsLittleEndian) {
                Array.Reverse(challenge);
                }
            
                HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                byte[] hash = hmac.ComputeHash(challenge);
                int offset = hash[19] & 0xf;
                int truncatedHash = hash[offset] & 0x7f;
                for (int i = 1; i < 4; i++)
                {
                truncatedHash <<= 8;
                truncatedHash |= hash[offset + i] & 0xff;
                }
                truncatedHash %= 1000000;
                return truncatedHash.ToString("D6");
                }"/>
                <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                  <set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
                  <set-method>POST</set-method>
                  <set-header name="Content-Type" exists-action="override">
                    <value>application/json</value>
                  </set-header>
                  <set-body>@{
                    return new JObject(
                    new JProperty("microservice", (string)context.Variables["client_id"]),
                    new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                    ).ToString();
                    }</set-body>
                </send-request>
            
                <set-header name="ServiceAuthorization" exists-action="override">
                  <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                </set-header>
              </inbound>
              <outbound>
                <base/>
              </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = true
      + display_name          = "refunds"
      + id                    = (known after apply)
      + product_id            = "refunds"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-prod"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "refunds"
      + resource_group_name = "cft-prod-network-rg"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":611,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->